SIMISA@@@@@@@@@@JINX0D0t______

Wagon ( OR-90294-C

Comment( British Rail WD 8F 2-8-0 Locomotive )
Comment( ******RESISTANCE BASED ON STILL WIND*******)Comment( *********REPORT BASED ADVANCED FEATURES APPLIED******* )

Comment( **Known Parameters Required for OR - Wagon Section**)

Comment( ************** General Information***************** )
Type ( Engine )
WagonShape ( DR_BR_WD_90733.s )
Size  ( 2.77125m 3.85144m 10.850880m )
Mass ( 70.25t-uk )

Comment( ************ Coupler Information ****************** )
	
Comment( == Rear Coupler == )
Coupling (
		Type ( Bar )
		Spring (
			Break ( 710kN 1220kN )
			r0 ( 0cm 10cm )
		)
		CouplingHasRigidConnection (1)
	)
Comment( == Front Coupler == )
	Coupling (
			Type ( Chain )
			Spring (
			Break ( 600kN 1000kN )
			r0 ( 10cm 20cm )
			)
	CouplingHasRigidConnection (0)
	)
	
Comment( ************ Brakes, Type, Force, etc *************** )
BrakeSystemType ( "Vacuum_single_pipe" )
MaxBrakeForce ( 192kN ) Comment(Brake % 55 DWt or MTWt CoF 0.5)
MaxHandbrakeForce ( 0kN ) Comment(ctn calc)
Comment(BrakeCylinderPressureForMaxBrakeBrakeForce ( 21inHg )) 

Comment (* Cast Iron Brakeshoes *)
ORTSBrakeShoeFriction ( 0.0 0.50 8.0 0.288 16.1 0.241 24.1 0.211 32.2 0.187 40.2 0.173 48.3 0.161 56.3 0.150 64.4 0.142 72.2 0.139 80.5 0.134 88.5 0.129 96.6 0.125 104.6 0.123 112.7 0.121)

Comment( ********* Curve Resistance & SuperElevation ********* )
CentreOfGravity ( 0m 2.75m 0m )
ORTSTrackGauge ( 4ft 8.5in )
ORTSUnbalancedSuperelevation ( 6in )
ORTSRigidWheelbase ( 16.0ft 3.0in )

Comment( ***************** Friction************************* )

ORTSBearingType ( Friction )

ORTSDavis_A ( 6418 )
ORTSDavis_B ( 23.49 )
ORTSDavis_C ( 5.342 )

ORTSWagonFrontalArea (100ft^2)
ORTSDavisDragConstant (0.0024)

Comment(  ******* Lights Section *******  Included in this section - Type, Colour, Location, Size, Control, etc)


Lights	( 3
		Light	(
			comment( Glowing firebox )
			Type( 0 )
			Conditions	(
					Headlight ( 0 )
					Unit ( 0 )
				)
			FadeIn	( 0.5 )
			FadeOut	( 0.5 )
			Cycle	( 0 )
			States	(	2
			State	(
					Duration ( 0.05 )
					LightColour ( eeff8800 )
					Position ( 0 2.1 -4.15 )
					Azimuth ( -180 -180 -180 )
					Transition ( 0 )
					Radius ( 1 )
   					Elevation ( -10 -10 -10 )
					)
			State	(
					Duration ( 0.05 )
					LightColour ( ffff8855 )
					Position ( 0 2.1 -4.15 )
					Azimuth ( -180 -180 -180 )
					Transition ( 0 )
					Radius ( 1.05 )
   					Elevation ( -10 -10 -10 )
					)
				)
			)
		
		Light	(
			comment( Flickering Front Oil Lamp Position B )
			Type( 0 )
			Conditions	(
					Headlight ( 4 )
					Unit ( 2 )
					)
			FadeIn	( 0.5 )
			FadeOut	( 0.5 )
			Cycle	( 0 )
			States	(	2
			State	(
					Duration ( 0.02 )
					LightColour ( ff808000 )
					Position ( 1.05 1.32 4.95 ) 
					Azimuth ( 0.0 -5.0 5.0 )
					Transition ( 0 )
					Radius ( 0.45 )
					)
			State	(
					Duration ( 0.2 )
					LightColour ( ccdddddd )
					Position ( 1.05 1.32 4.95 ) 
					Azimuth ( 0.0 -5.0 5.0 )
					Transition ( 0 )
					Radius ( 0.40 )
					)
				)
			)
Light	(
			comment( Flickering Front Oil Lamp Position C )
			Type( 0 )
			Conditions	(
					Headlight ( 4 )
					Unit ( 2 )
					)
			FadeIn	( 0.5 )
			FadeOut	( 0.5 )
			Cycle	( 0 )
			States	(	2
			State	(
					Duration ( 0.02 )
					LightColour ( ff808000 )
					Position ( 0 1.32 4.95 ) 
					Azimuth ( 0.0 -5.0 5.0 )
					Transition ( 0 )
					Radius ( 0.45 )
					)
			State	(
					Duration ( 0.2 )
					LightColour ( ccdddddd )
					Position ( 0 1.32 4.95 ) 
					Azimuth ( 0.0 -5.0 5.0 )
					Transition ( 0 )
					Radius ( 0.40 )
					)
				)
			)
		)
	
Comment( ******* Miscellaneous Wagon Information************ )

Comment (Passenger View)	
	Inside (
        PassengerCabinFile ( DR_BR_WD_90733.s )
        PassengerCabinHeadPos ( 1.5 3.0 -4.6  )
        RotationLimit ( 90 180 160 )
        StartDirection ( 0 0 0 )
  	)

Sound ( "..\\..\\Common.MEP\\Standard2MT-4MTSound\\Standardeng.sms" )
)



Engine ( OR-90294-C

Comment( *Known Parameters Required for OR - Engine Section*)

Comment (Section for Engine Effects - Steam Emissions, Stack) 

Effects
	(
	SteamSpecialEffects	(
	comment(the format of these little blocks is as follow:

	offset.x offset.y offset.z
	normal.x normal.y normal.z
	width in metres

	defining the offset from the shape pivot point where steam / 	smoke should appear, the direction it should go and the 	width of the nozzle
			)

			WhistleFX
			(
				0 3.605 -3.0
				0 0 1
				0.2
			)

			SafetyValvesFX
			(
				0.174 3.675 -1.097
				0 1 0
				0.2
			)
			SafetyValvesFX
			(
				-0.174 3.675 -1.097
				0 1 0
				0.35
			)
			StackFX
			(
				0 3.675 3.048
				0 0.95 0
				0.3
			)
			StackFX
			(
				0 3.675 3.048
				0 0.95 0
				0.25
			)
			StackFX
			(
				0 3.675 3.048
				0 0.95 0
				0.25
			)
			DrainpipeFX
			(
				-1.5 1.258 -3.886
				-1 -1 -1
				0.05
			)

			Injectors1FX
			(
				-1.15 0.7 -5.1
				0 -1 -1
				0.15
			)
			Injectors2FX
			(
				1.15 0.7 -5.1 
				0 -1 -1
				0.15
			)

			CylindersFX
			(
				-1.023 0.23 3.55
				0 0.0875 1
				0.2
			)

			CylindersFX
			(
				1.023 0.23 3.55
				0 0.0875 1
				0.2
			)
		)
	)

Wagon ( OR-90294-C )
Comment ( *************General Information****************** )

ORTSSteamLocomotiveType ( Simple )
Type ( Steam )
WheelRadius ( 28.25in )
NumWheels ( 4 )
ORTSDriveWheelWeight ( 61.25t-uk )
Sanding ( 25mph )

Comment ( ******************** Boiler ************************ )

ORTSSteamBoilerType ( Superheated )
BoilerVolume ( 201ft^3 )  Comment(Calculated from freight weight)
ORTSEvaporationArea ( 1519ft^2 )
ORTSSuperheatArea ( 298ft^2 )
MaxBoilerPressure ( 225psi )
Comment(MaxSteamHeatingPressure ( 80psi )) Comment(Assume no steam heating)

Comment ( ****************** Cylinders *********************** )

NumCylinders ( 2 )
CylinderStroke ( 28in ) 
CylinderDiameter ( 19in ) 
ORTSCylinderEfficiencyRate ( 1.0 )  

Comment ( ********************* Fire ************************* ) 

ORTSFuelCalorific ( 13700btu/lb )
ORTSGrateArea ( 28.6ft^2 )
SteamFiremanMaxPossibleFiringRate( 3000 ) 
ShovelCoalMass ( 14lb )     

Comment ( ********************* Fuel ************************* )

MaxTenderCoalMass ( 20160lb )
MaxTenderWaterMass ( 50000lb )
IsTenderRequired( 1 )	

Comment(       ********ADVANCED PARAMETERS**********      )
Comment( Remove comment statement and outer brackets as required)

ORTSBoilerEvaporationRate ( 15 )

ORTSMaxIndicatedHorsepower ( 1600.0hp )

ORTSMaxSuperheatTemperature ( 275.0 )

comment(ORTSSuperheatCutoffPressureFactor ( 58.0 ))

Comment(ORTSCylinderPortOpening ( 0.085 ))Comment(0.05 to 0.12)

ORTSBoilerEfficiency( 0.0 0.96  180.0 0.48 )Comment(Report 8P Gr 16)comment(0 0.97 140.0 0.485)

Comment(ORTSBurnRate( 0.0 10.0   9714.0 1000.0   17714.0 2000.0   23714.0 3000.0   28571.0 4000.0   31428.0 5000.0   33428.0 6000.0  ))


comment(ORTSBoilerEfficiency( 0.0 0.97  102.0 0.61 ))comment(Report Gr 16)comment(0 0.97 140.0 0.485)

Comment(ORTSBurnRate( 0.0 10.0   11714.0 1000.0   19714.0 2000.0   25714.0 3000.0   32571.0 4000.0   35428.0 5000.0   37428.0 6000.0  ))

ORTSBurnRate( 0.0 10.0   12000.0 1000.0   21000.0 2000.0   27000.0 3000.0   36000.0 4000.0   37000.0 5000.0   37500.0 6000.0  )

Comment(ORTSCylinderInitialPressureDrop ( 0.0 0.99 350 0.98 ))

Comment(ORTSCylinderBackPressure ( 0.0 0.0  3000 12.0  ))

    
Comment ( *****************Brake System ******************** )   

TrainBrakesControllerMinSystemPressure( 0 )
TrainBrakesControllerMaxSystemPressure( 21inHg )
BrakeEquipmentType ( "Vacuum_brake, Handbrake " )
BrakeSystemType ( "Vacuum_single_pipe" )

Comment(************Train Control Sysytem (if used)**********        

Includes Monitoring of Overspeed, Vigilance, Emergency Braking 

*************************************************************)

     
Comment ( **************** Engine Controls ***************** )   
EngineControllers (
Regulator ( 0 1 0.0475 0 
            NumNotches( 0 )
    			)
Cutoff    ( -0.75 0.75 0.01 0 
            NumNotches( 0 )		
  		)

Brake_Train ( 0 1 0.1 0.5
NumNotches( 3
Notch ( 0.0 0 TrainBrakesControllerReleaseStart )
Notch ( 0.1 0 TrainBrakesControllerRunningStart )
Notch ( 0.2 1 TrainBrakesControllerVacuumContinuousServiceStart ) ) )
            
Brake_Hand ( 0 1 0.0125 0
	NumNotches ( 0 ))
FireDoor ( 4 4 0.4 0
	NumNotches ( 0 ))
Sanding( 0 1 0 )
Blower ( 0 1 0.025 0.2
	NumNotches ( 0 ))

Shovel ( 0 1 0.1 0
	NumNotches ( 0 ))
DampersFront ( 0 1 0.1 1
	NumNotches ( 0 ))
DampersBack ( 0 1 0.1 0
	NumNotches ( 0 ))
Injector1Steam ( 0 1 0 )
Injector2Steam ( 0 1 0 )
Injector1Water ( 0 1 0.1 0
	NumNotches ( 0 ))
Injector2Water ( 0 1 0.1 0
	NumNotches ( 0 ))
CylinderCocks ( 0 1 1 )
Whistle ( 0 1 0 )
WaterScoop ( 0 1 0 )
SmallEjectorOrCompressor( 0 1 1 )
BellToggle( 0 1 0 )
Headlights( 0 1 0 )
)

Comment ( ************ Miscellaneous Information ************* )   

Cabview ( StandardWD.cvf )
HeadOut (  -1.5 3.0 -4.6 )
Sound ( "..\\..\\Common.MEP\\Standard2MT-4MTSound\\Standardcab.sms" )
Name ( "90294 BR WD 8F 2-8-0, Class C, Coal 9t, Water 5000gal" )
Description (
"The War Department (WD) Austerity 2-8-0 is a type of heavy freight steam locomotive that was introduced in 1943 for war service. A total of 935 were built, making this one of the most-produced classes of British steam locomotive. They were nicknamed Ozzies by the railwaymen.

The Austerity 2-8-0 was based on the LMS Class 8F, which until that point had been the government's standard design. Various modifications were made to the 8F design by R.A. Riddles in order to prioritise low cost over design life. These included a boiler of simpler construction which was parallel rather than tapered and a round-topped firebox rather than a Belpaire firebox. The firebox was made of steel rather than the rarer and more expensive copper.
After the end of the conflict, the War Department disposed of 930 locomotives (Two engines being retained by the War Department and three being scrapped).

200 were sold to the LNER, which classified them as "Class O7" and numbered them 3000–3199. In 1948, 533 more were purchased by the British Transport Commission.

With the formation of British Railways, the 733 locomotives were renumbered into the 90000–90732 series. Only one of those, No. 90732, was named, becoming Vulcan, after the Vulcan Foundry where many of the locomotives were built.")
)
